IPSNewbie/STM32F429_OV5640_FreeRTOS/BSPDrivers/Src/camera_sd_storage.c
#include "camera_sd_storage.h"

#include "bsp_log.h"
#include "camera_snapshot_control.h"
#include "stm32f4xx_hal.h"

#include <stddef.h>
#include <string.h>

/*
 * Stage 11C-1 在既有冲突引脚切换成功后，将 PC8～PC12 和 PD2 配置为 SDIO AF12，
 * 并在 EXIT 时先将六个引脚退回 GPIO 输入态，再恢复 PC8、PC9、PC11 的 DCMI AF13。
 * PC8、PC9、PC11 同时被 DCMI 和 SDIO 使用，后续必须先停止 DCMI 和相关 DMA，
 * 再进入 SDIO 接管流程。Stage 11C-4 在 HAL_SD_Init 成功后读取 HAL 层卡信息，
 * 不接入 FATFS，不执行块读写，也不启用 SDIO 中断或 DMA。
 */
static CameraSdStorageStatus_t s_camera_sd_status;
static SD_HandleTypeDef hsd_snapshot;
/* 使用 uint32_t 数组保证 4 字节对齐，仅用于 HAL SD polling 只读块验证，不写卡。 */
static uint32_t s_sd_read_test_words[128];

/* C5D-2 独立调试状态：不进入 CameraSdStorageStatus_t，也不参与 INIT/EXIT。 */
typedef struct
{
    uint32_t supported;
    uint32_t requested_width;
    uint32_t active_width;
    uint32_t attempt_count;
    uint32_t success_count;
    uint32_t error_count;
    uint32_t last_result;
    uint32_t last_hal_status;
    uint32_t last_hal_error;
    uint32_t last_pre_card_state;
    uint32_t last_post_card_state;
    uint32_t last_wait_card_state;
    uint32_t last_operation_ms;
    uint32_t last_wait_operation_ms;
    uint32_t last_wait_timeout_ms;
} Camera_SDBusWidthDebug_t;

static Camera_SDBusWidthDebug_t s_bus_width_debug = {1U};

#define CAMERA_SD_CONFLICT_PIN_MASK \
    (GPIO_PIN_8 | GPIO_PIN_9 | GPIO_PIN_11)
#define CAMERA_SD_CONFLICT_MODE_MASK \
    ((3UL << (8U * 2U)) | (3UL << (9U * 2U)) | (3UL << (11U * 2U)))
#define CAMERA_SD_CONFLICT_AF_MODE \
    ((2UL << (8U * 2U)) | (2UL << (9U * 2U)) | (2UL << (11U * 2U)))
#define CAMERA_SD_CONFLICT_SPEED_VERY_HIGH \
    CAMERA_SD_CONFLICT_MODE_MASK
#define CAMERA_SD_CONFLICT_PULLUP \
    ((1UL << (8U * 2U)) | (1UL << (9U * 2U)) | (1UL << (11U * 2U)))
#define CAMERA_SD_CONFLICT_AFRH_MASK \
    ((0xFUL << 0U) | (0xFUL << 4U) | (0xFUL << 12U))
#define CAMERA_SD_CONFLICT_AFRH_AF12 \
    ((12UL << 0U) | (12UL << 4U) | (12UL << 12U))
#define CAMERA_SD_CONFLICT_AFRH_AF13 \
    ((13UL << 0U) | (13UL << 4U) | (13UL << 12U))

#define CAMERA_SD_FULL_GPIOC_PIN_MASK \
    (GPIO_PIN_8 | GPIO_PIN_9 | GPIO_PIN_10 | GPIO_PIN_11 | GPIO_PIN_12)
#define CAMERA_SD_FULL_GPIOC_MODE_MASK \
    ((3UL << (8U * 2U)) | (3UL << (9U * 2U)) | \
     (3UL << (10U * 2U)) | (3UL << (11U * 2U)) | \
     (3UL << (12U * 2U)))
#define CAMERA_SD_FULL_GPIOC_AF_MODE \
    ((2UL << (8U * 2U)) | (2UL << (9U * 2U)) | \
     (2UL << (10U * 2U)) | (2UL << (11U * 2U)) | \
     (2UL << (12U * 2U)))
#define CAMERA_SD_FULL_GPIOC_PULLUP \
    ((1UL << (8U * 2U)) | (1UL << (9U * 2U)) | \
     (1UL << (10U * 2U)) | (1UL << (11U * 2U)) | \
     (1UL << (12U * 2U)))
#define CAMERA_SD_FULL_GPIOC_AFRH_MASK \
    ((0xFUL << 0U) | (0xFUL << 4U) | (0xFUL << 8U) | \
     (0xFUL << 12U) | (0xFUL << 16U))
#define CAMERA_SD_FULL_GPIOC_AFRH_AF12 \
    ((12UL << 0U) | (12UL << 4U) | (12UL << 8U) | \
     (12UL << 12U) | (12UL << 16U))

#define CAMERA_SD_FULL_GPIOD_PIN_MASK GPIO_PIN_2
#define CAMERA_SD_FULL_GPIOD_MODE_MASK (3UL << (2U * 2U))
#define CAMERA_SD_FULL_GPIOD_AF_MODE (2UL << (2U * 2U))
#define CAMERA_SD_FULL_GPIOD_PULLUP (1UL << (2U * 2U))
#define CAMERA_SD_FULL_GPIOD_AFRL_MASK (0xFUL << 8U)
#define CAMERA_SD_FULL_GPIOD_AFRL_AF12 (12UL << 8U)

typedef struct
{
    GPIO_TypeDef *port;
    uint32_t pin_number;
    const char *name;
} Camera_SDLineDef_t;

static const Camera_SDLineDef_t s_camera_sd_lines[] =
{
    {GPIOC, 8U, "pc8_d0"},
    {GPIOC, 9U, "pc9_d1"},
    {GPIOC, 10U, "pc10_d2"},
    {GPIOC, 11U, "pc11_d3"},
    {GPIOC, 12U, "pc12_ck"},
    {GPIOD, 2U, "pd2_cmd"}
};

static uint32_t Camera_SDStorage_GetPinMode(
    GPIO_TypeDef *port,
    uint32_t pin_number)
{
    return (port->MODER >> (pin_number * 2U)) & 0x3U;
}

static uint32_t Camera_SDStorage_GetPinPull(
    GPIO_TypeDef *port,
    uint32_t pin_number)
{
    return (port->PUPDR >> (pin_number * 2U)) & 0x3U;
}

static uint32_t Camera_SDStorage_GetPinSpeed(
    GPIO_TypeDef *port,
    uint32_t pin_number)
{
    return (port->OSPEEDR >> (pin_number * 2U)) & 0x3U;
}

static uint32_t Camera_SDStorage_GetPinAf(
    GPIO_TypeDef *port,
    uint32_t pin_number)
{
    if (pin_number < 8U)
    {
        return (port->AFR[0] >> (pin_number * 4U)) & 0xFU;
    }

    return (port->AFR[1] >> ((pin_number - 8U) * 4U)) & 0xFU;
}

static uint32_t Camera_SDStorage_GetPinIdr(
    GPIO_TypeDef *port,
    uint32_t pin_number)
{
    return (port->IDR >> pin_number) & 0x1U;
}

static void Camera_SDStorage_PrepareSdHandle(void)
{
    hsd_snapshot.Instance = SDIO;
    hsd_snapshot.Init.ClockEdge = SDIO_CLOCK_EDGE_RISING;
    hsd_snapshot.Init.ClockBypass = SDIO_CLOCK_BYPASS_DISABLE;
    hsd_snapshot.Init.ClockPowerSave = SDIO_CLOCK_POWER_SAVE_DISABLE;
    /* Stage 11C-4 保持 1-bit 初始化，不切换 4-bit，也不配置宽总线。 */
    hsd_snapshot.Init.BusWide = SDIO_BUS_WIDE_1B;
    hsd_snapshot.Init.HardwareFlowControl =
        SDIO_HARDWARE_FLOW_CONTROL_DISABLE;
    /* ClockDiv=118U 用于保守的 SDIO 初始化低速阶段。 */
    hsd_snapshot.Init.ClockDiv = 118U;
    /* Stage 11C-4 读取 HAL 层卡信息，不接 FATFS，不执行块读写。 */
}

static void Camera_SDStorage_EnableSdioClock(void)
{
    __HAL_RCC_SDIO_CLK_ENABLE();
    s_camera_sd_status.sdio_clock_enabled = 1U;
}

static void Camera_SDStorage_DisableSdioClock(void)
{
    __HAL_RCC_SDIO_CLK_DISABLE();
    s_camera_sd_status.sdio_clock_enabled = 0U;
}

static uint32_t Camera_SDStorage_ReadCardInfo(void)
{
    uint32_t start_ms;
    HAL_StatusTypeDef hal_status;
    HAL_SD_CardInfoTypeDef card_info;

    if ((s_camera_sd_status.is_initialized != 1U) ||
        (s_camera_sd_status.sdio_ready != 1U))
    {
        /* HAL_SD_Init 未成功时禁止访问卡信息，也不增加实际读取计数。 */
        return CAMERA_SD_ERR_SDIO_HAL_INIT_FAILED;
    }

    ++s_camera_sd_status.card_info_read_attempt_count;
    start_ms = HAL_GetTick();
    hal_status = HAL_SD_GetCardInfo(&hsd_snapshot, &card_info);
    s_camera_sd_status.last_card_info_operation_ms =
        HAL_GetTick() - start_ms;
    s_camera_sd_status.last_card_info_status = (uint32_t)hal_status;
    s_camera_sd_status.last_card_info_error = HAL_SD_GetError(&hsd_snapshot);
    s_camera_sd_status.last_hal_sd_state =
        (uint32_t)HAL_SD_GetState(&hsd_snapshot);
    s_camera_sd_status.last_hal_sd_card_state =
        (uint32_t)HAL_SD_GetCardState(&hsd_snapshot);

    if (hal_status == HAL_OK)
    {
        ++s_camera_sd_status.card_info_read_success_count;
        s_camera_sd_status.card_type = card_info.CardType;
        s_camera_sd_status.card_version = card_info.CardVersion;
        s_camera_sd_status.card_class = card_info.Class;
        s_camera_sd_status.card_rel_card_add = card_info.RelCardAdd;
        s_camera_sd_status.card_block_nbr = card_info.BlockNbr;
        s_camera_sd_status.card_block_size = card_info.BlockSize;
        s_camera_sd_status.card_log_block_nbr = card_info.LogBlockNbr;
        s_camera_sd_status.card_log_block_size = card_info.LogBlockSize;
        s_camera_sd_status.last_error_code = CAMERA_SD_OK;
        return CAMERA_SD_OK;
    }

    ++s_camera_sd_status.card_info_read_error_count;
    s_camera_sd_status.last_error_code = CAMERA_SD_ERR_CARD_INFO_FAILED;
    return CAMERA_SD_ERR_CARD_INFO_FAILED;
}

static uint32_t Camera_SDStorage_WaitCardTransfer(uint32_t timeout_ms)
{
    uint32_t start_ms;
    uint32_t elapsed_ms;
    HAL_SD_CardStateTypeDef card_state;

