IPSNewbie/STM32F429_OV5640_FreeRTOS/BSPDrivers/Src/camera_sd_storage.c
    if ((s_camera_sd_status.is_initialized != 1U) ||
        (s_camera_sd_status.sdio_ready != 1U))
    {
        s_camera_sd_status.last_error_code =
            CAMERA_SD_ERR_BLOCK_READ_NOT_READY;
        return CAMERA_SD_ERR_BLOCK_READ_NOT_READY;
    }

    ++s_camera_sd_status.block_read_wait_transfer_attempt_count;
    s_camera_sd_status.last_block_read_wait_timeout_ms = timeout_ms;
    start_ms = HAL_GetTick();

    for (;;)
    {
        card_state = HAL_SD_GetCardState(&hsd_snapshot);
        s_camera_sd_status.last_block_read_wait_card_state =
            (uint32_t)card_state;
        elapsed_ms = HAL_GetTick() - start_ms;

        if (card_state == HAL_SD_CARD_TRANSFER)
        {
            ++s_camera_sd_status.block_read_wait_transfer_success_count;
            s_camera_sd_status.last_block_read_wait_operation_ms = elapsed_ms;
            return CAMERA_SD_OK;
        }

        if (elapsed_ms >= timeout_ms)
        {
            ++s_camera_sd_status.block_read_wait_transfer_error_count;
            s_camera_sd_status.last_block_read_wait_operation_ms = elapsed_ms;
            s_camera_sd_status.last_error_code =
                CAMERA_SD_ERR_BLOCK_READ_NOT_READY;
            return CAMERA_SD_ERR_BLOCK_READ_NOT_READY;
        }

        HAL_Delay(1U);
    }
}

/* 与 C5R 读前等待使用相同的 polling 方式，但只更新独立调试状态。 */
static uint32_t Camera_SDStorage_DebugWaitCardTransfer(uint32_t timeout_ms)
{
    uint32_t start_ms = HAL_GetTick();
    uint32_t elapsed_ms;
    HAL_SD_CardStateTypeDef card_state = HAL_SD_GetCardState(&hsd_snapshot);

    s_bus_width_debug.last_wait_timeout_ms = timeout_ms;
    s_bus_width_debug.last_wait_operation_ms = 0U;
    s_bus_width_debug.last_pre_card_state = (uint32_t)card_state;

    for (;;)
    {
        s_bus_width_debug.last_wait_card_state = (uint32_t)card_state;
        elapsed_ms = HAL_GetTick() - start_ms;

        if (card_state == HAL_SD_CARD_TRANSFER)
        {
            s_bus_width_debug.last_wait_operation_ms = elapsed_ms;
            return CAMERA_SD_OK;
        }

        if (elapsed_ms >= timeout_ms)
        {
            s_bus_width_debug.last_wait_operation_ms = elapsed_ms;
            return CAMERA_SD_ERR_BUS_WIDTH_WAIT_TRANSFER_FAILED;
        }

        HAL_Delay(1U);
        card_state = HAL_SD_GetCardState(&hsd_snapshot);
    }
}

static uint32_t Camera_SDStorage_ReadBlockTest(uint32_t block_addr)
{
    uint8_t *read_buffer = (uint8_t *)s_sd_read_test_words;
    uint32_t start_ms;
    uint32_t index;
    uint32_t sum = 0U;
    uint32_t xor_value = 0U;
    uint32_t nonzero_count = 0U;
    uint32_t wait_result;
    HAL_StatusTypeDef hal_status;

    if ((s_camera_sd_status.block_read_test_enabled != 1U) ||
        (s_camera_sd_status.is_initialized != 1U) ||
        (s_camera_sd_status.sdio_ready != 1U) ||
        (s_camera_sd_status.card_info_read_success_count == 0U) ||
        ((s_camera_sd_status.card_log_block_size != 512U) &&
         (s_camera_sd_status.card_block_size != 512U)) ||
        ((s_camera_sd_status.card_log_block_nbr != 0U) &&
         (block_addr >= s_camera_sd_status.card_log_block_nbr)))
    {
        /* 前置条件不满足时不访问硬件，也不覆盖上一次成功读取的缓存。 */
        s_camera_sd_status.last_error_code =
            CAMERA_SD_ERR_BLOCK_READ_NOT_READY;
        return CAMERA_SD_ERR_BLOCK_READ_NOT_READY;
    }

    wait_result = Camera_SDStorage_WaitCardTransfer(1000U);
    if (wait_result != CAMERA_SD_OK)
    {
        return wait_result;
    }

    s_camera_sd_status.last_block_read_pre_card_state =
        (uint32_t)HAL_SD_GetCardState(&hsd_snapshot);
    memset(read_buffer, 0, sizeof(s_sd_read_test_words));
    ++s_camera_sd_status.block_read_attempt_count;
    s_camera_sd_status.last_block_read_addr = block_addr;
    s_camera_sd_status.last_block_read_count = 1U;

    start_ms = HAL_GetTick();
    hal_status = HAL_SD_ReadBlocks(
        &hsd_snapshot,
        read_buffer,
        block_addr,
        1U,
        1000U);
    s_camera_sd_status.last_block_read_operation_ms =
        HAL_GetTick() - start_ms;
    s_camera_sd_status.last_block_read_status = (uint32_t)hal_status;
    s_camera_sd_status.last_block_read_error =
        HAL_SD_GetError(&hsd_snapshot);
    s_camera_sd_status.last_block_read_error_is_data_crc_fail =
        ((s_camera_sd_status.last_block_read_error &
          HAL_SD_ERROR_DATA_CRC_FAIL) != 0U) ? 1U : 0U;
    s_camera_sd_status.last_block_read_error_is_cmd_crc_fail =
        ((s_camera_sd_status.last_block_read_error &
          HAL_SD_ERROR_CMD_CRC_FAIL) != 0U) ? 1U : 0U;
    s_camera_sd_status.last_block_read_error_is_cmd_rsp_timeout =
        ((s_camera_sd_status.last_block_read_error &
          HAL_SD_ERROR_CMD_RSP_TIMEOUT) != 0U) ? 1U : 0U;
    s_camera_sd_status.last_block_read_error_is_data_timeout =
        ((s_camera_sd_status.last_block_read_error &
          HAL_SD_ERROR_DATA_TIMEOUT) != 0U) ? 1U : 0U;
    s_camera_sd_status.last_block_read_error_is_rx_overrun =
        ((s_camera_sd_status.last_block_read_error &
          HAL_SD_ERROR_RX_OVERRUN) != 0U) ? 1U : 0U;
    s_camera_sd_status.last_block_read_error_is_tx_underrun =
        ((s_camera_sd_status.last_block_read_error &
          HAL_SD_ERROR_TX_UNDERRUN) != 0U) ? 1U : 0U;
    s_camera_sd_status.last_hal_sd_state =
        (uint32_t)HAL_SD_GetState(&hsd_snapshot);
    s_camera_sd_status.last_block_read_post_card_state =
        (uint32_t)HAL_SD_GetCardState(&hsd_snapshot);
    s_camera_sd_status.last_hal_sd_card_state =
        s_camera_sd_status.last_block_read_post_card_state;

    if (hal_status != HAL_OK)
    {
        ++s_camera_sd_status.block_read_error_count;
        s_camera_sd_status.last_block_read_size = 0U;
        s_camera_sd_status.last_block_read_sum = 0U;
        s_camera_sd_status.last_block_read_xor = 0U;
        s_camera_sd_status.last_block_read_nonzero_count = 0U;
        memset(
            s_camera_sd_status.last_block_read_first16,
            0,
            sizeof(s_camera_sd_status.last_block_read_first16));
        s_camera_sd_status.last_error_code =
            CAMERA_SD_ERR_BLOCK_READ_FAILED;
        return CAMERA_SD_ERR_BLOCK_READ_FAILED;
    }

    for (index = 0U; index < sizeof(s_sd_read_test_words); ++index)
    {
        uint32_t value = read_buffer[index];

        sum += value;
        xor_value ^= value;
        if (value != 0U)
        {
            ++nonzero_count;
        }
    }

    ++s_camera_sd_status.block_read_success_count;
    s_camera_sd_status.last_block_read_size =
        (uint32_t)sizeof(s_sd_read_test_words);
    s_camera_sd_status.last_block_read_sum = sum;
    s_camera_sd_status.last_block_read_xor = xor_value;
    s_camera_sd_status.last_block_read_nonzero_count = nonzero_count;
    memcpy(
        s_camera_sd_status.last_block_read_first16,
        read_buffer,
        sizeof(s_camera_sd_status.last_block_read_first16));
    s_camera_sd_status.last_error_code = CAMERA_SD_OK;
    return CAMERA_SD_OK;
}

static uint32_t Camera_SDStorage_ReleaseConflictPins(void)
{
    uint32_t start_ms = HAL_GetTick();
    GPIO_InitTypeDef gpio = {0};

    ++s_camera_sd_status.conflict_pin_release_attempt_count;

    /* 只释放 PC8、PC9、PC11；不配置 PC10、PC12、PD2 或任何 SDIO 复用。 */
    gpio.Pin = CAMERA_SD_CONFLICT_PIN_MASK;
    gpio.Mode = GPIO_MODE_INPUT;
    gpio.Pull = GPIO_NOPULL;
    gpio.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(GPIOC, &gpio);

    if (((GPIOC->MODER & CAMERA_SD_CONFLICT_MODE_MASK) != 0U) ||
        ((GPIOC->PUPDR & CAMERA_SD_CONFLICT_MODE_MASK) != 0U))
    {
        ++s_camera_sd_status.conflict_pin_release_error_count;
        s_camera_sd_status.conflict_pins_released = 0U;
        s_camera_sd_status.last_conflict_pin_error_code =
            CAMERA_SD_ERR_CONFLICT_PIN_RELEASE_FAILED;
        s_camera_sd_status.last_conflict_pin_operation_ms =
            HAL_GetTick() - start_ms;
        return CAMERA_SD_ERR_CONFLICT_PIN_RELEASE_FAILED;
    }

    ++s_camera_sd_status.conflict_pin_release_success_count;
    s_camera_sd_status.conflict_pins_released = 1U;
    s_camera_sd_status.last_conflict_pin_error_code = CAMERA_SD_OK;
    s_camera_sd_status.last_conflict_pin_operation_ms =
        HAL_GetTick() - start_ms;
    return CAMERA_SD_OK;
}

