IPSNewbie/STM32F429_OV5640_FreeRTOS/BSPDrivers/Src/camera_sd_storage.c
    *status = s_camera_sd_status;
}

uint32_t Camera_SDStorage_DebugSetBusWidth(uint32_t bus_width)
{
    uint32_t wait_result;
    uint32_t hal_bus_width;
    uint32_t start_ms;
    HAL_StatusTypeDef hal_status;

    if ((bus_width != 1U) && (bus_width != 4U))
    {
        ++s_bus_width_debug.error_count;
        s_bus_width_debug.last_result = CAMERA_SD_ERR_BUS_WIDTH_INVALID;
        return CAMERA_SD_ERR_BUS_WIDTH_INVALID;
    }

    if ((s_camera_sd_status.is_initialized != 1U) ||
        (s_camera_sd_status.sdio_ready != 1U))
    {
        ++s_bus_width_debug.error_count;
        s_bus_width_debug.last_result = CAMERA_SD_ERR_BUS_WIDTH_NOT_READY;
        return CAMERA_SD_ERR_BUS_WIDTH_NOT_READY;
    }

    s_bus_width_debug.requested_width = bus_width;
    ++s_bus_width_debug.attempt_count;

    wait_result = Camera_SDStorage_DebugWaitCardTransfer(1000U);
    if (wait_result != CAMERA_SD_OK)
    {
        ++s_bus_width_debug.error_count;
        s_bus_width_debug.last_result =
            CAMERA_SD_ERR_BUS_WIDTH_WAIT_TRANSFER_FAILED;
        return CAMERA_SD_ERR_BUS_WIDTH_WAIT_TRANSFER_FAILED;
    }

    s_bus_width_debug.last_pre_card_state =
        (uint32_t)HAL_SD_GetCardState(&hsd_snapshot);
    hal_bus_width = (bus_width == 1U)
        ? SDIO_BUS_WIDE_1B
        : SDIO_BUS_WIDE_4B;
    start_ms = HAL_GetTick();
    hal_status = HAL_SD_ConfigWideBusOperation(
        &hsd_snapshot,
        hal_bus_width);
    s_bus_width_debug.last_operation_ms = HAL_GetTick() - start_ms;
    s_bus_width_debug.last_hal_status = (uint32_t)hal_status;
    s_bus_width_debug.last_hal_error = HAL_SD_GetError(&hsd_snapshot);
    s_bus_width_debug.last_post_card_state =
        (uint32_t)HAL_SD_GetCardState(&hsd_snapshot);

    if (hal_status == HAL_OK)
    {
        s_bus_width_debug.active_width = bus_width;
        ++s_bus_width_debug.success_count;
        s_bus_width_debug.last_result = CAMERA_SD_OK;
        return CAMERA_SD_OK;
    }

    ++s_bus_width_debug.error_count;
    s_bus_width_debug.last_result = CAMERA_SD_ERR_BUS_WIDTH_CONFIG_FAILED;
    return CAMERA_SD_ERR_BUS_WIDTH_CONFIG_FAILED;
}

void Camera_SDStorage_DebugPrintBusWidthStatus(void)
{
    /* LOG_RAW 使用项目现有 printf 风格串口输出，不依赖 CLI 私有函数。 */
    LOG_RAW("SD BUSWIDTH:\r\n");
    LOG_RAW("  supported=%lu\r\n", (unsigned long)s_bus_width_debug.supported);
    LOG_RAW("  requested_width=%lu\r\n", (unsigned long)s_bus_width_debug.requested_width);
    LOG_RAW("  active_width=%lu\r\n", (unsigned long)s_bus_width_debug.active_width);
    LOG_RAW("  attempt_count=%lu\r\n", (unsigned long)s_bus_width_debug.attempt_count);
    LOG_RAW("  success_count=%lu\r\n", (unsigned long)s_bus_width_debug.success_count);
    LOG_RAW("  error_count=%lu\r\n", (unsigned long)s_bus_width_debug.error_count);
    LOG_RAW("  last_result=%lu\r\n", (unsigned long)s_bus_width_debug.last_result);
    LOG_RAW("  last_hal_status=%lu\r\n", (unsigned long)s_bus_width_debug.last_hal_status);
    LOG_RAW("  last_hal_error=0x%08lX\r\n", (unsigned long)s_bus_width_debug.last_hal_error);
    LOG_RAW("  last_pre_card_state=%lu\r\n", (unsigned long)s_bus_width_debug.last_pre_card_state);
    LOG_RAW("  last_post_card_state=%lu\r\n", (unsigned long)s_bus_width_debug.last_post_card_state);
    LOG_RAW("  last_wait_card_state=%lu\r\n", (unsigned long)s_bus_width_debug.last_wait_card_state);
    LOG_RAW("  last_operation_ms=%lu\r\n", (unsigned long)s_bus_width_debug.last_operation_ms);
    LOG_RAW("  last_wait_operation_ms=%lu\r\n", (unsigned long)s_bus_width_debug.last_wait_operation_ms);
    LOG_RAW("  last_wait_timeout_ms=%lu\r\n", (unsigned long)s_bus_width_debug.last_wait_timeout_ms);
}

void Camera_SDStorage_PrintLineState(void)
{
    uint32_t index;

    LOG_RAW("SD LINESTATE:\r\n");
    LOG_RAW("  linestate_readonly=1\r\n");
    LOG_RAW("  linestate_hal_sd_api_call=0\r\n");
    LOG_RAW("  is_initialized=%lu\r\n", (unsigned long)s_camera_sd_status.is_initialized);
    LOG_RAW("  sdio_ready=%lu\r\n", (unsigned long)s_camera_sd_status.sdio_ready);
    LOG_RAW("  sdio_full_gpio_af12_selected=%lu\r\n", (unsigned long)s_camera_sd_status.sdio_full_gpio_af12_selected);
    LOG_RAW("  sdio_af12_selected=%lu\r\n", (unsigned long)s_camera_sd_status.sdio_af12_selected);
    LOG_RAW("  conflict_pins_released=%lu\r\n", (unsigned long)s_camera_sd_status.conflict_pins_released);
    LOG_RAW("  hal_sd_state=%lu\r\n", (unsigned long)s_camera_sd_status.last_hal_sd_state);
    LOG_RAW("  hal_sd_card_state=%lu\r\n", (unsigned long)s_camera_sd_status.last_hal_sd_card_state);
    LOG_RAW("  gpioc_moder=0x%08lX\r\n", (unsigned long)GPIOC->MODER);
    LOG_RAW("  gpioc_pupdr=0x%08lX\r\n", (unsigned long)GPIOC->PUPDR);
    LOG_RAW("  gpioc_ospeedr=0x%08lX\r\n", (unsigned long)GPIOC->OSPEEDR);
    LOG_RAW("  gpioc_afr1=0x%08lX\r\n", (unsigned long)GPIOC->AFR[1]);
    LOG_RAW("  gpioc_idr=0x%08lX\r\n", (unsigned long)GPIOC->IDR);
    LOG_RAW("  gpiod_moder=0x%08lX\r\n", (unsigned long)GPIOD->MODER);
    LOG_RAW("  gpiod_pupdr=0x%08lX\r\n", (unsigned long)GPIOD->PUPDR);
    LOG_RAW("  gpiod_ospeedr=0x%08lX\r\n", (unsigned long)GPIOD->OSPEEDR);
    LOG_RAW("  gpiod_afr0=0x%08lX\r\n", (unsigned long)GPIOD->AFR[0]);
    LOG_RAW("  gpiod_idr=0x%08lX\r\n", (unsigned long)GPIOD->IDR);

    for (index = 0U;
         index < (sizeof(s_camera_sd_lines) / sizeof(s_camera_sd_lines[0]));
         ++index)
    {
        const Camera_SDLineDef_t *line = &s_camera_sd_lines[index];

        LOG_RAW(
            "  %s_mode=%lu\r\n",
            line->name,
            (unsigned long)Camera_SDStorage_GetPinMode(
                line->port,
                line->pin_number));
        LOG_RAW(
            "  %s_pull=%lu\r\n",
            line->name,
            (unsigned long)Camera_SDStorage_GetPinPull(
                line->port,
                line->pin_number));
        LOG_RAW(
            "  %s_speed=%lu\r\n",
            line->name,
            (unsigned long)Camera_SDStorage_GetPinSpeed(
                line->port,
                line->pin_number));
        LOG_RAW(
            "  %s_af=%lu\r\n",
            line->name,
            (unsigned long)Camera_SDStorage_GetPinAf(
                line->port,
                line->pin_number));
        LOG_RAW(
            "  %s_idr=%lu\r\n",
            line->name,
            (unsigned long)Camera_SDStorage_GetPinIdr(
                line->port,
                line->pin_number));
    }
}

uint32_t Camera_SDStorage_RequestBlockReadTest(uint32_t block_addr)
{
    return Camera_SDStorage_ReadBlockTest(block_addr);
}

